import { useTitle } from "../../../Utils/UseTitle";
import "./About.css"; // Your CSS styles
import profileSource from "../../../Assets/Images/about.png";

export function About() {
  useTitle("About");


  return (
    <div className="About">

    <div className="about-content">
      <div className="about-pic">
        <img src={profileSource} alt="Profile" className="profile-pic" />
      </div>

      <div className="about-info">
        <h2>מאחורי המצלמה</h2>
        <p>
          תמיד חלמתי ונמשכתי לתחום הצילום.
          
          אז בגיל 29 החלטתי שזה אף פעם לא מאוחר מידי, הגשמתי חלום, רכשתי מצלמה ולמדתי צילום מקצועי.
          
          אני מאמין שלצילום יש ערך עצום בחיינו, שמאחורי כל רגע מסתתר סיפור שמחכה שינציחו אותו.
          
          וכצלם יש לי את הזכות לתעד ולתפוס את הרגש והאותנטיות.
          
          בתור אבא אני מעריך יותר את החשיבות של תפיסת הרגע בצורה המדויקת והאיכותית ביותר כדי שיישאר לנו כזיכרון שילווה אותנו לכל החיים.
          
          את תחילת דרכי התחלתי בצילומי אירועים אווירה ומגנטים.
          
          אני מאמין שלמידה היא לא רק כלי לצמיחה והצלחה עסקית, אלא גם משהו שמזין את הנפש.
          
          כי כשלומדים משהו שאוהבים זאת תשוקה ולא רק עבודה.
          
          אז לאחר שהתמקצעתי בצילום אירועים הבנתי שאני צמא לעוד...
          
          המשכתי להתפתח לתחומים נוספים בעולם הצילום.
          
          ומזמין אתכם להצטרף אלי למסע הזה יחד.
        </p>
        </div>
    </div>
  </div>
  );
}
